ZalgoSoft/esp32-cam-webserver/app_httpd.cpp
    }
  }

  else if (!strcmp(variable, "ptz")) {
    if (!strcmp(value, "up" )) {
      if (ptz_y <= 180) {
        ptz_y += Servo_Step;
//        servo1.write(ptz_y);
      }
      Log.printf("PTZ: %i\t%i\t", ptz_x, ptz_y);
      Log.println("Up");
    }
    else if (!strcmp(value,  "left" )) {
      if (ptz_x <= 180) {
        ptz_x += Servo_Step;
//        servo2.write(ptz_x);
      }
      Log.printf("PTZ: %i\t%i\t", ptz_x, ptz_y);
      Log.println("Left");
    }
    else if (!strcmp(value, "right" )) {
      if (ptz_x >= 0) {
        ptz_x -= Servo_Step;
//        servo2.write(ptz_x);
      }
      Log.printf("PTZ: %i\t%i\t", ptz_x, ptz_y);
      Log.println("Right");
    }
    else if (!strcmp(value, "down" )) {
      if (ptz_y >= 0) {
        ptz_y -= Servo_Step;
//        servo1.write(ptz_y);
      }
      Log.printf("PTZ: %i\t%i\t" , ptz_x , ptz_y);
      Log.println("Down");
    }
    else if (!strcmp(value, "center" )) {
      ptz_x = 90;
      ptz_y = 90;
//      servo1.write(ptz_y);
//      servo2.write(ptz_x);
      Log.printf("PTZ: %i\t%i\t", ptz_x, ptz_y);
      Log.println("Center");
    }
  } else if (!strcmp(variable, "ptz_x")) {
    if (val >= 0 && val <= 180 ) {
      ptz_x = val;
//      servo2.write(ptz_x);
      Log.printf("PTZ: %i\t", ptz_x);
      Log.println("PTZ pos x");
    }
  } else if (!strcmp(variable, "ptz_y")) {
    if (val >= 0 && val <= 180 ) {
      ptz_y = val;
//      servo1.write(ptz_y);
      Log.printf("PTZ: %i\t", ptz_y);
      Log.println("PTZ pos y");
    }
  }   else if (!strcmp(variable, "servo_step")) {
    if (val >= 0 && val <= 90 ) {
      Servo_Step = val;
      Log.printf("PTZ: %i\t", Servo_Step );
      Log.println("PTZ Step Size");
    }
  } else if (!strcmp(variable, "servo1_pin")) {
    if (val >= 0 && val <= 31 ) {
      Servo1Pin = val;
      Log.printf("PTZ: %i\t", Servo1Pin );
      Log.println("PTZ Servo1Pin");
    }
  } else if (!strcmp(variable, "servo2_pin")) {
    if (val >= 0 && val <= 31 ) {
      Servo2Pin = val;
      Log.printf("PTZ: %i\t", Servo2Pin );
      Log.println("PTZ Servo2Pin");
    }
  }
  else {
    res = -1;
  }
  if (res) {
    return httpd_resp_send_500(req);
  }
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, NULL, 0);
}

static esp_err_t status_handler(httpd_req_t *req) {
  static char json_response[1024];
  char * p = json_response;
  *p++ = '{';
  // Do not get attempt to get sensor when in error; causes a panic..
  if (critERR.length() == 0) {
    sensor_t * s = esp_camera_sensor_get();
    p += sprintf(p, "\"lamp\":%d,", lampVal);
    p += sprintf(p, "\"autolamp\":%d,", autoLamp);
    p += sprintf(p, "\"min_frame_time\":%d,", minFrameTime);
    p += sprintf(p, "\"framesize\":%u,", s->status.framesize);
    p += sprintf(p, "\"quality\":%u,", s->status.quality);
    p += sprintf(p, "\"xclk\":%u,", xclk);
    p += sprintf(p, "\"brightness\":%d,", s->status.brightness);
    p += sprintf(p, "\"contrast\":%d,", s->status.contrast);
    p += sprintf(p, "\"saturation\":%d,", s->status.saturation);
    p += sprintf(p, "\"sharpness\":%d,", s->status.sharpness);
    p += sprintf(p, "\"special_effect\":%u,", s->status.special_effect);
    p += sprintf(p, "\"wb_mode\":%u,", s->status.wb_mode);
    p += sprintf(p, "\"awb\":%u,", s->status.awb);
    p += sprintf(p, "\"awb_gain\":%u,", s->status.awb_gain);
    p += sprintf(p, "\"aec\":%u,", s->status.aec);
    p += sprintf(p, "\"aec2\":%u,", s->status.aec2);
    p += sprintf(p, "\"ae_level\":%d,", s->status.ae_level);
    p += sprintf(p, "\"aec_value\":%u,", s->status.aec_value);
    p += sprintf(p, "\"agc\":%u,", s->status.agc);
    p += sprintf(p, "\"agc_gain\":%u,", s->status.agc_gain);
    p += sprintf(p, "\"gainceiling\":%u,", s->status.gainceiling);
    p += sprintf(p, "\"bpc\":%u,", s->status.bpc);
    p += sprintf(p, "\"wpc\":%u,", s->status.wpc);
    p += sprintf(p, "\"raw_gma\":%u,", s->status.raw_gma);
    p += sprintf(p, "\"lenc\":%u,", s->status.lenc);
    p += sprintf(p, "\"vflip\":%u,", s->status.vflip);
    p += sprintf(p, "\"hmirror\":%u,", s->status.hmirror);
    p += sprintf(p, "\"dcw\":%u,", s->status.dcw);
    p += sprintf(p, "\"colorbar\":%u,", s->status.colorbar);
    p += sprintf(p, "\"cam_name\":\"%s\",", myName);
    p += sprintf(p, "\"code_ver\":\"%s\",", myVer);
    p += sprintf(p, "\"rotate\":\"%d\",", myRotation);
    p += sprintf(p, "\"servo1_pin\":%u,", Servo1Pin );
    p += sprintf(p, "\"servo2_pin\":%u,", Servo2Pin );
    p += sprintf(p, "\"servo_step\":%u,",  Servo_Step );
    p += sprintf(p, "\"ptz_y\":%u,",  ptz_y );
    p += sprintf(p, "\"ptz_x\":%u,",  ptz_x );
    p += sprintf(p, "\"stream_url\":\"%s\"", streamURL);
  }
  *p++ = '}';
  *p++ = 0;
  httpd_resp_set_type(req, "application/json");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, json_response, strlen(json_response));
}

static esp_err_t info_handler(httpd_req_t *req) {
  static char json_response[256];
  char * p = json_response;
  *p++ = '{';
  p += sprintf(p, "\"cam_name\":\"%s\",", myName);
  p += sprintf(p, "\"rotate\":\"%d\",", myRotation);
  p += sprintf(p, "\"stream_url\":\"%s\"", streamURL);
  *p++ = '}';
  *p++ = 0;
  httpd_resp_set_type(req, "application/json");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, json_response, strlen(json_response));
}

static esp_err_t favicon_16x16_handler(httpd_req_t *req) {
  httpd_resp_set_type(req, "image/png");
  httpd_resp_set_hdr(req, "Content-Encoding", "identity");
  return httpd_resp_send(req, (const char *)favicon_16x16_png, favicon_16x16_png_len);
}

static esp_err_t favicon_32x32_handler(httpd_req_t *req) {
  httpd_resp_set_type(req, "image/png");
  httpd_resp_set_hdr(req, "Content-Encoding", "identity");
  return httpd_resp_send(req, (const char *)favicon_32x32_png, favicon_32x32_png_len);
}

static esp_err_t favicon_ico_handler(httpd_req_t *req) {
  httpd_resp_set_type(req, "image/x-icon");
  httpd_resp_set_hdr(req, "Content-Encoding", "identity");
  return httpd_resp_send(req, (const char *)favicon_ico, favicon_ico_len);
}

